{
    "projects" : [
        {
            "image" : "",
            "title": "EMR",
            "bodyText": "•Leading the development of a versatile patient reports portal with customizable configurations, facilitating seamless integrations across diverse systems. Ensuring enhanced accessibility and usability from any location s•Ensuring code coverage surpassing the 90% mark, maintaining a focus on comprehensive testing and thorough validation of software functionalities •Conceptualizing & crafting a mobile-responsive application, prioritizing an optimal user experience across various devices & screen sizes •Orchestrating and managing Continuous Integration/Continuous Deployment (CI/CD) pipelines for UI deployments, guaranteeing the smooth delivery of updates. Proactively identifying and resolving deployment-related issues to uphold application stability and reliability •Fostering close collaboration with functional teams to assess feasibility and effectiveness. Leveraging insights derived from collaboration to drive strategic decision-making processes and optimize project outcomes",
            "links": [
            ],
            "tags" : [
                "HTML",
                "CSS",
                "JavaScript",
                "React",
                "Redux",
                "Jest",
                "React-Context",
                "Lazy Loading"             
            ]
        },
        {
            "image" : "",
            "title": "Patient Portal",
            "bodyText": "•Spearheaded the conception, development, and implementation of six cutting-edge modules, demonstrating exceptional autonomy and proficiency in frontend development •Introduced & integrated SonarQube as a robust code quality analysis tool, addressing and resolving all code-quality challenges       . •Implemented stringent code review processes to maintain high standards of code cleanliness, readability, and maintainability throughout the project lifecycle. •Undertook sole responsibility for managing Node modules, ensuring seamless integration and optimal performance across the project ecosystem",
            "links": [
               
            ],
            "tags" : [
                "HTML",
                "CSS",
                "JavaScript",
                "React",
                "Redux",
                "Jest",
                "React-Context",
                "Lazy Loading"   
            ]
        },
        {
            "image" : "",
            "title": "HIS",
            "bodyText": 
            "•Successfully orchestrated a comprehensive migration initiative, seamlessly transitioning up to 20% of the expansive project from Angular to React.                       •Implemented a migration to React-Bootstrap from plain CSS for up to 20% of the entire codebase, elevating the project's styling capabilities and harnessing the efficiency of a robust UI framework.       •Showcased a commitment to code quality and reliability by independently authoring unit test cases; through meticulous implementation of Test-Driven Development (TDD) methodologies, achieved an impressive 90% code coverage, ensuring robustness and stability throughout the codebase. •Spearheaded the introduction and application of lazy loading concepts, leading to a remarkable 40% reduction in bundle size.     .•Maintained a proactive stance towards innovation, continuously seeking opportunities to enhance development workflows and adopt emerging technologies",
            "links": [
            ],
            "tags" : [
                "HTML",
                "CSS",
                "JavaScript",
                "React",
                "Jest",
                "React-Context",
                "Lazy Loading" 
            ]
        }
    ]
}